[
  [
    "Affenpinscher",
    false,
    "The Affenpinscher is a small, toy breed with a monkey-like face and a curious personality. Known for being playful and confident, they make excellent companions for small apartments.",
    "12-14"
  ],
  [
    "Afghan Hound",
    false,
    "The Afghan Hound is a sleek, elegant dog with a distinctive long, flowing coat. They are known for their independence, speed, and ability to hunt in harsh terrain.",
    "12-14"
  ],
  [
    "Airedale Terrier",
    false,
    "The Airedale Terrier is the largest of the terrier breeds. Intelligent and versatile, they were originally bred for hunting and are known for their courageous and loyal nature.",
    "10-13"
  ],
  [
    "Akita",
    false,
    "The Akita is a large, powerful breed known for its loyalty and courage. Originally bred in Japan for hunting, they are independent and protective, making them great family dogs.",
    "10-12"
  ],
  [
    "Alaskan Malamute",
    false,
    "The Alaskan Malamute is a large, strong breed originally bred for pulling heavy loads in harsh Arctic conditions. They are friendly, loyal, and great with families.",
    "10-14"
  ],
  [
    "American Bulldog",
    false,
    "The American Bulldog is a strong, muscular breed with a gentle temperament. Originally bred for farm work and protection, they are playful and protective with family members.",
    "10-12"
  ],
  [
    "American Cocker Spaniel",
    false,
    "The American Cocker Spaniel is a small, affectionate dog with a lovely, silky coat. Known for being friendly and intelligent, they make great pets for families.",
    "12-15"
  ],
  [
    "American Eskimo Dog",
    false,
    "The American Eskimo Dog is a fluffy, white breed with a strong sense of intelligence. They are playful, loyal, and thrive on regular mental and physical stimulation.",
    "12-15"
  ],
  [
    "American Foxhound",
    false,
    "The American Foxhound is a breed developed for hunting. Known for their stamina and endurance, they are friendly, gentle, and get along well with other dogs.",
    "12-13"
  ],
  [
    "American Pit Bull Terrier",
    false,
    "The American Pit Bull Terrier is a strong, muscular dog with a loyal and affectionate nature. They are often misunderstood but make excellent family pets when raised with care.",
    "12-14"
  ],
  [
    "American Staffordshire Terrier",
    false,
    "The American Staffordshire Terrier is a muscular and strong dog with a friendly and loyal personality. Known for their protective nature, they are great family companions.",
    "12-14"
  ],
  [
    "American Water Spaniel",
    false,
    "The American Water Spaniel is an intelligent and energetic breed with a curly coat. They are excellent water retrievers and make great companions for active families.",
    "12-14"
  ],
  [
    "Anatolian Shepherd Dog",
    false,
    "The Anatolian Shepherd Dog is a large, powerful guardian breed originally used to protect livestock. They are independent, loyal, and protective of their family.",
    "10-13"
  ],
  [
    "Appenzeller Sennenhund",
    false,
    "The Appenzeller Sennenhund is a medium-sized, hardworking herding breed from Switzerland. They are intelligent, energetic, and make excellent companions for active families.",
    "12-14"
  ],
  [
    "Australian Cattle Dog",
    false,
    "The Australian Cattle Dog is a hardworking, intelligent breed originally bred for herding cattle. They are energetic, loyal, and require a lot of exercise and mental stimulation.",
    "12-16"
  ],
  [
    "Australian Kelpie",
    false,
    "The Australian Kelpie is an energetic, hardworking dog bred for herding. They are highly intelligent, quick to learn, and excel in various canine sports.",
    "12-14"
  ],
  [
    "Australian Shepherd",
    false,
    "The Australian Shepherd is a highly intelligent, energetic breed known for its herding abilities. They are friendly, loyal, and make excellent working dogs and family companions.",
    "13-15"
  ],
  [
    "Australian Terrier",
    false,
    "The Australian Terrier is a small, sturdy dog with a bold and independent personality. They are friendly, affectionate, and make great pets for active individuals.",
    "12-15"
  ],
  [
    "Azawakh",
    false,
    "The Azawakh is a graceful, sighthound breed originating from West Africa. Known for their speed and elegance, they are independent and protective but bond closely with their family.",
    "12-14"
  ],
  [
    "Barbet",
    false,
    "The Barbet is a medium-sized, curly-coated breed from France. Known for their friendly, intelligent nature, they are great swimmers and make wonderful family pets.",
    "12-14"
  ],
  [
    "Basenji",
    false,
    "The Basenji is a small, energetic breed known for their lack of barking and their cat-like grooming habits. They are independent, intelligent, and make excellent companions for active owners.",
    "12-14"
  ],
  [
    "Basset Hound",
    false,
    "The Basset Hound is a low, long-bodied dog with an excellent sense of smell. Known for being calm and affectionate, they are often stubborn but loyal to their family.",
    "10-12"
  ],
  [
    "Beagle",
    false,
    "The Beagle is a small to medium-sized dog known for its incredible sense of smell and friendly personality. They are curious, energetic, and make excellent family pets.",
    "12-15"
  ],
  [
    "Bearded Collie",
    false,
    "The Bearded Collie is an energetic and playful breed with a thick, flowing coat. Known for their affectionate and friendly personality, they are great companions for families.",
    "12-14"
  ],
  [
    "Beauceron",
    false,
    "The Beauceron is a large, intelligent herding dog from France. They are protective, alert, and make excellent working dogs, though they require plenty of exercise and training.",
    "10-12"
  ],
  [
    "Bedlington Terrier",
    false,
    "The Bedlington Terrier is a small, unique dog with a lamb-like coat. Known for their spirited and friendly nature, they are intelligent and make great family pets.",
    "12-14"
  ],
  [
    "Belgian Malinois",
    false,
    "The Belgian Malinois is a highly intelligent, active herding dog. They are known for their work ethic, loyalty, and protective nature, excelling in police and military roles.",
    "12-14"
  ],
  [
    "Belgian Sheepdog",
    false,
    "The Belgian Sheepdog is an elegant herding dog with a thick, black coat. Known for their intelligence, loyalty, and versatility, they make excellent working dogs and family companions.",
    "12-14"
  ],
  [
    "Belgian Tervuren",
    false,
    "The Belgian Tervuren is a medium-sized herding dog with a thick, long coat. They are intelligent, energetic, and require regular mental stimulation and exercise.",
    "12-14"
  ],
  [
    "Bernese Mountain Dog",
    false,
    "The Bernese Mountain Dog is a large, gentle breed with a thick coat. They are friendly, loyal, and great with families, though their large size requires regular exercise.",
    "7-10"
  ],
  [
    "Bichon Frise",
    false,
    "The Bichon Frise is a small, cheerful dog with a soft, curly coat. Known for their friendly and playful nature, they are excellent companion dogs and adapt well to various living environments.",
    "12-15"
  ],
  [
    "Black and Tan Coonhound",
    false,
    "The Black and Tan Coonhound is a medium-to-large breed known for its hunting abilities. They are loyal, energetic, and make excellent companions for active families.",
    "10-12"
  ],
  [
    "Bloodhound",
    false,
    "The Bloodhound is a large breed with an incredible sense of smell. They are friendly, determined, and make excellent tracking dogs, often used in search and rescue missions.",
    "10-12"
  ],
  [
    "Bluetick Coonhound",
    false,
    "The Bluetick Coonhound is a scent hound known for its excellent tracking abilities. They are energetic, independent, and make great companions for experienced owners.",
    "12-14"
  ],
  [
    "Boerboel",
    false,
    "The Boerboel is a large, powerful dog originally bred to protect farms. They are loyal, protective, and make excellent guard dogs, though they require firm training and socialization.",
    "9-11"
  ],
  [
    "Border Collie",
    false,
    "The Border Collie is a highly intelligent and energetic breed known for its herding abilities. They are active, alert, and excel in obedience and dog sports.",
    "12-15"
  ],
  [
    "Border Terrier",
    false,
    "The Border Terrier is a small, friendly dog with a rough coat. They are affectionate, intelligent, and make great companions for families with children.",
    "12-15"
  ],
  [
    "Borzoi",
    false,
    "The Borzoi is a large, elegant sighthound known for its graceful movements. Originally bred for hunting, they are gentle, independent, and good with families.",
    "10-12"
  ],
  [
    "Boston Terrier",
    false,
    "The Boston Terrier is a small, compact breed with a distinctive tuxedo-like coat. Known for their friendly and affectionate nature, they are excellent companions.",
    "11-13"
  ],
  [
    "Bouvier des Flandres",
    false,
    "The Bouvier des Flandres is a large, rugged herding dog with a thick, rough coat. They are intelligent, protective, and require regular exercise and grooming.",
    "10-12"
  ],
  [
    "Boxer",
    false,
    "The Boxer is a medium-to-large breed known for its boundless energy and affectionate nature. They are playful, loyal, and protective of their families.",
    "10-12"
  ],
  [
    "Boykin Spaniel",
    false,
    "The Boykin Spaniel is a medium-sized hunting dog with a friendly, outgoing nature. They are intelligent, energetic, and make excellent hunting companions.",
    "10-14"
  ],
  [
    "Bracco Italiano",
    false,
    "The Bracco Italiano is a large, gentle dog with a strong hunting instinct. They are friendly, intelligent, and make great family pets for active owners.",
    "10-14"
  ],
  [
    "Briard",
    false,
    "The Briard is a large, shaggy herding dog known for its intelligence and loyalty. They are protective, energetic, and thrive in active households.",
    "10-12"
  ],
  [
    "Brittany",
    false,
    "The Brittany is an energetic, versatile gun dog known for its exceptional hunting abilities. They are intelligent, friendly, and make great pets for active families.",
    "12-14"
  ],
  [
    "Brussels Griffon",
    false,
    "The Brussels Griffon is a small, affectionate toy breed with a distinctive face. They are friendly, intelligent, and enjoy being the center of attention.",
    "12-15"
  ],
  [
    "Bull Terrier",
    false,
    "The Bull Terrier is a muscular breed with a unique, egg-shaped head. Known for their playful and affectionate nature, they are loyal and make great family pets.",
    "10-12"
  ],
  [
    "Bulldog",
    false,
    "The Bulldog is a medium-sized dog with a distinctive wrinkled face and stocky body. They are calm, loyal, and affectionate, making them excellent companions for families.",
    "8-12"
  ],
  [
    "Bullmastiff",
    false,
    "The Bullmastiff is a large, powerful breed originally bred to guard estates. They are calm, protective, and gentle, making them excellent family protectors.",
    "8-10"
  ],
  [
    "Cairn Terrier",
    false,
    "The Cairn Terrier is a small, spirited breed known for its curiosity and energy. They are friendly, intelligent, and make great companions for families.",
    "12-15"
  ],
  [
    "Canaan Dog",
    false,
    "The Canaan Dog is a medium-sized, intelligent breed originally used as a working dog in the Middle East. They are independent, loyal, and make excellent watchdogs.",
    "12-15"
  ],
  [
    "Cane Corso",
    false,
    "The Cane Corso is a large, powerful breed known for its guarding abilities. They are protective, intelligent, and require proper training and socialization.",
    "9-12"
  ],
  [
    "Cardigan Welsh Corgi",
    false,
    "The Cardigan Welsh Corgi is a small, sturdy herding dog with a long body and short legs. They are friendly, intelligent, and make great family companions.",
    "12-15"
  ],
  [
    "Cavalier King Charles Spaniel",
    false,
    "The Cavalier King Charles Spaniel is a small, elegant toy breed with a sweet, affectionate nature. They are friendly, intelligent, and make great companions for families.",
    "12-15"
  ],
  [
    "Chesapeake Bay Retriever",
    false,
    "The Chesapeake Bay Retriever is a medium-to-large sporting dog known for its excellent swimming and retrieving skills. They are intelligent, loyal, and make great family pets.",
    "10-13"
  ],
  [
    "Chihuahua",
    false,
    "The Chihuahua is a tiny breed with a big personality. Known for their loyalty and sassiness, they are intelligent and adapt well to various living situations.",
    "12-20"
  ],
  [
    "Chinese Crested",
    false,
    "The Chinese Crested is a small, hairless breed known for its unique appearance. They are affectionate, intelligent, and make great pets for owners who enjoy companionship.",
    "12-15"
  ],
  [
    "Chinese Shar-Pei",
    false,
    "The Chinese Shar-Pei is a medium-sized breed with a distinctive wrinkled coat and `hippopotamus` face. They are calm, loyal, and independent, making them great companions for families and individuals alike.",
    "8-12"
  ],
  [
    "Chinook",
    false,
    "The Chinook is a medium-to-large sled dog breed known for its friendly and adaptable personality. They are intelligent, energetic, and make great family pets and working dogs.",
    "12-15"
  ],
  [
    "Chow Chow",
    false,
    "The Chow Chow is a large breed known for its lion-like mane and independent nature. They are calm, loyal, and protective, requiring firm training and early socialization.",
    "8-12"
  ],
  [
    "Clumber Spaniel",
    false,
    "The Clumber Spaniel is a medium-sized breed with a distinctively long body and thick coat. They are calm, affectionate, and love to hunt, making them great companions for active families.",
    "10-12"
  ],
  [
    "Cocker Spaniel",
    false,
    "The Cocker Spaniel is a small, friendly dog with long, beautiful ears. They are gentle, affectionate, and require regular grooming and exercise.",
    "12-15"
  ],
  [
    "Collie",
    false,
    "The Collie is a large, graceful breed with a beautiful coat. They are intelligent, loyal, and protective, making them great family pets and working dogs.",
    "12-14"
  ],
  [
    "Coonhound",
    false,
    "The Coonhound is a medium-to-large breed known for its excellent hunting and tracking abilities. They are energetic, friendly, and make great companions for active families.",
    "10-12"
  ],
  [
    "Corgi",
    false,
    "The Corgi is a small, sturdy herding breed with a playful and affectionate personality. They are intelligent, friendly, and make excellent pets for active families.",
    "12-15"
  ],
  [
    "Coton de Tulear",
    false,
    "The Coton de Tulear is a small, cheerful dog with a cotton-like coat. Known for their friendly and playful nature, they make great companions and adapt well to various living situations.",
    "14-16"
  ],
  [
    "Curly-Coated Retriever",
    false,
    "The Curly-Coated Retriever is a large, energetic breed with a distinctive curly coat. They are friendly, intelligent, and excel in water retrieval, making them great family pets and working dogs.",
    "12-14"
  ],
  [
    "Dachshund",
    false,
    "The Dachshund is a small breed with a long body and short legs. Known for their independent and curious nature, they are loyal, playful, and make excellent companions.",
    "12-16"
  ],
  [
    "Dalmatian",
    false,
    "The Dalmatian is a medium-sized breed known for its distinctive coat of black or liver spots. They are energetic, intelligent, and make great family pets, though they require a lot of exercise.",
    "10-13"
  ],
  [
    "Dandie Dinmont Terrier",
    false,
    "The Dandie Dinmont Terrier is a small, affectionate breed with a distinctive topknot of hair. They are friendly, intelligent, and make great companions for individuals and families.",
    "12-15"
  ],
  [
    "Doberman Pinscher",
    false,
    "The Doberman Pinscher is a sleek, powerful breed known for its intelligence, loyalty, and protective nature. They make excellent guard dogs and family companions.",
    "10-13"
  ],
  [
    "Dogo Argentino",
    false,
    "The Dogo Argentino is a large, muscular breed originally bred for hunting and protection. They are brave, loyal, and protective, making them excellent family guardians.",
    "9-15"
  ],
  [
    "Dogue de Bordeaux",
    false,
    "The Dogue de Bordeaux is a large, powerful mastiff breed known for its loyal and protective nature. They are calm, affectionate, and make great family pets and guardians.",
    "8-10"
  ],
  [
    "Dutch Shepherd",
    false,
    "The Dutch Shepherd is a medium-to-large herding breed known for its intelligence and versatility. They are loyal, energetic, and thrive in active households that can provide mental stimulation.",
    "12-14"
  ],
  [
    "English Cocker Spaniel",
    false,
    "The English Cocker Spaniel is a small to medium-sized breed known for its cheerful personality and long, flowing coat. They are affectionate, intelligent, and great with families.",
    "12-15"
  ],
  [
    "English Foxhound",
    false,
    "The English Foxhound is a medium-to-large breed bred for hunting. They are friendly, intelligent, and make great companions for active families or individuals.",
    "10-13"
  ],
  [
    "English Setter",
    false,
    "The English Setter is a medium-to-large sporting dog known for its beautiful coat and gentle nature. They are friendly, intelligent, and make great family pets.",
    "10-12"
  ],
  [
    "English Shepherd",
    false,
    "The English Shepherd is a medium-sized herding breed known for its intelligence and agility. They are loyal, protective, and great for active families or farms.",
    "12-15"
  ],
  [
    "English Springer Spaniel",
    false,
    "The English Springer Spaniel is a medium-sized bird dog known for its friendly, energetic nature. They are intelligent, loyal, and make great family pets.",
    "12-14"
  ],
  [
    "English Toy Spaniel",
    false,
    "The English Toy Spaniel is a small, affectionate dog with a distinctive look. They are friendly, playful, and make excellent companions for families and individuals.",
    "10-12"
  ],
  [
    "Entlebucher Mountain Dog",
    false,
    "The Entlebucher Mountain Dog is a small to medium-sized herding breed from Switzerland. They are intelligent, energetic, and thrive in active households where they can work or exercise regularly.",
    "12-15"
  ],
  [
    "Field Spaniel",
    false,
    "The Field Spaniel is a medium-sized sporting dog known for its calm temperament and distinctive coat. They are affectionate, friendly, and make great companions for families.",
    "10-12"
  ],
  [
    "Finnish Lapphund",
    false,
    "The Finnish Lapphund is a medium-sized herding breed known for its fluffy coat and friendly personality. They are intelligent, energetic, and thrive in active households.",
    "12-15"
  ],
  [
    "Finnish Spitz",
    false,
    "The Finnish Spitz is a medium-sized breed known for its fox-like appearance and energetic nature. They are intelligent, independent, and make great companions for active owners.",
    "12-15"
  ],
  [
    "Flat-Coated Retriever",
    false,
    "The Flat-Coated Retriever is a medium-to-large breed known for its friendly, exuberant personality. They are intelligent, energetic, and make excellent family pets.",
    "8-12"
  ],
  [
    "French Bulldog",
    false,
    "The French Bulldog is a small, compact breed known for its distinctive bat-like ears and friendly, affectionate nature. They are playful, intelligent, and make great companions.",
    "10-12"
  ],
  [
    "German Pinscher",
    false,
    "The German Pinscher is a medium-sized breed known for its sleek coat and confident personality. They are intelligent, energetic, and make great pets for active families.",
    "12-14"
  ],
  [
    "German Shepherd Dog",
    false,
    "The German Shepherd Dog is a large, versatile breed known for its intelligence and work ethic. They are loyal, protective, and excel in various working roles.",
    "9-13"
  ],
  [
    "German Shorthaired Pointer",
    false,
    "The German Shorthaired Pointer is a medium-to-large sporting dog known for its exceptional hunting skills. They are energetic, intelligent, and make great family pets.",
    "12-14"
  ],
  [
    "German Wirehaired Pointer",
    false,
    "The German Wirehaired Pointer is a medium-to-large breed with a distinctive wiry coat. They are energetic, intelligent, and excel in hunting, making them great companions for active owners.",
    "12-14"
  ],
  [
    "Giant Schnauzer",
    false,
    "The Giant Schnauzer is a large, powerful breed known for its protective nature and versatility. They are intelligent, loyal, and make excellent family pets and guard dogs.",
    "10-12"
  ],
  [
    "Glen of Imaal Terrier",
    false,
    "The Glen of Imaal Terrier is a small, sturdy breed known for its calm demeanor and loyalty. They are intelligent, independent, and make great companions for families and individuals.",
    "12-14"
  ],
  [
    "Golden Retriever",
    false,
    "The Golden Retriever is a large, friendly breed known for its intelligence and gentle nature. They are loyal, playful, and make excellent family pets and working dogs.",
    "10-12"
  ],
  [
    "Gordon Setter",
    false,
    "The Gordon Setter is a large, elegant breed known for its beautiful coat and excellent hunting abilities. They are intelligent, energetic, and great companions for active families.",
    "10-12"
  ],
  [
    "Great Dane",
    false,
    "The Great Dane is a giant breed known for its imposing size and gentle nature. Despite their size, they are affectionate, friendly, and make great family pets.",
    "7-10"
  ],
  [
    "Great Pyrenees",
    false,
    "The Great Pyrenees is a large, majestic breed known for its calm demeanor and protective nature. They are gentle, intelligent, and make excellent family guardians and working dogs.",
    "10-12"
  ],
  [
    "Greater Swiss Mountain Dog",
    false,
    "The Greater Swiss Mountain Dog is a large, sturdy breed known for its strength and loyalty. They are intelligent, affectionate, and make great family pets and working dogs.",
    "8-11"
  ],
  [
    "Greyhound",
    false,
    "The Greyhound is a medium-to-large breed known for its speed and elegant appearance. They are calm, friendly, and make excellent pets for individuals and families looking for a laid-back companion.",
    "10-14"
  ],
  [
    "Harrier",
    false,
    "The Harrier is a medium-sized breed known for its excellent hunting and tracking abilities. They are friendly, energetic, and thrive in active households that provide ample exercise.",
    "12-15"
  ],
  [
    "Havanese",
    false,
    "The Havanese is a small, friendly breed with a silky coat and playful personality. They are affectionate, intelligent, and make great companions for families and individuals.",
    "12-16"
  ],
  [
    "Irish Setter",
    false,
    "The Irish Setter is a medium-to-large sporting breed known for its energetic and friendly nature. They are intelligent, playful, and make great pets for active families.",
    "10-15"
  ],
  [
    "Irish Terrier",
    false,
    "The Irish Terrier is a small-to-medium breed known for its bold and spirited personality. They are loyal, intelligent, and make excellent companions for active owners.",
    "12-15"
  ],
  [
    "Irish Water Spaniel",
    false,
    "The Irish Water Spaniel is a medium-sized breed known for its curly coat and love of water. They are energetic, intelligent, and excel in water sports, making them great pets for active families.",
    "10-12"
  ],
  [
    "Irish Wolfhound",
    false,
    "The Irish Wolfhound is a giant breed known for its size and gentle, calm nature. They are loyal, affectionate, and make excellent family pets and protectors.",
    "6-8"
  ],
  [
    "Italian Greyhound",
    false,
    "The Italian Greyhound is a small, sleek breed known for its elegance and speed. They are affectionate, intelligent, and make great companions for individuals and families.",
    "12-15"
  ],
  [
    "Jack Russell Terrier",
    false,
    "The Jack Russell Terrier is a small, energetic breed known for its intelligence and hunting instincts. They are playful, independent, and make great companions for active owners.",
    "12-15"
  ],
  [
    "Japanese Chin",
    false,
    "The Japanese Chin is a small, elegant toy breed known for its distinctive appearance and friendly nature. They are affectionate, intelligent, and make excellent companions.",
    "12-14"
  ],
  [
    "Japanese Spitz",
    false,
    "The Japanese Spitz is a small-to-medium breed known for its fluffy coat and fox-like appearance. They are friendly, intelligent, and make great family pets and companions.",
    "12-16"
  ],
  [
    "Keeshond",
    false,
    "The Keeshond is a medium-sized breed known for its distinctive `fox-like` face and friendly personality. They are intelligent, loyal, and make great companions for families and individuals.",
    "12-15"
  ],
  [
    "Kerry Blue Terrier",
    false,
    "The Kerry Blue Terrier is a medium-sized breed known for its wavy coat and energetic, intelligent nature. They are loyal, playful, and make great pets for active families.",
    "12-15"
  ],
  [
    "Komondor",
    false,
    "The Komondor is a large, distinctive breed known for its corded coat, which resembles dreadlocks. They are protective, intelligent, and make excellent guardians and family pets.",
    "10-12"
  ],
  [
    "Kooikerhondje",
    false,
    "The Kooikerhondje is a small-to-medium breed from the Netherlands known for its agility and hunting abilities. They are friendly, intelligent, and make great family pets.",
    "12-14"
  ],
  [
    "Kuvasz",
    false,
    "The Kuvasz is a large, protective breed known for its loyalty and guarding instincts. They are intelligent, independent, and make excellent guardians for families and livestock.",
    "10-12"
  ],
  [
    "Labrador Retriever",
    false,
    "The Labrador Retriever is a large, friendly breed known for its intelligence and excellent temperament. They are loyal, energetic, and make great family pets and working dogs.",
    "10-12"
  ],
  [
    "Lagotto Romagnolo",
    false,
    "The Lagotto Romagnolo is a medium-sized breed known for its curly coat and excellent nose for truffle hunting. They are intelligent, energetic, and make great family pets.",
    "12-14"
  ],
  [
    "Lakeland Terrier",
    false,
    "The Lakeland Terrier is a small, spirited breed known for its energetic and feisty nature. They are intelligent, affectionate, and make great companions for active individuals.",
    "12-15"
  ],
  [
    "Leonberger",
    false,
    "The Leonberger is a giant breed known for its size and gentle, friendly personality. They are intelligent, loyal, and make excellent family pets and guardians.",
    "8-9"
  ],
  [
    "Lhasa Apso",
    false,
    "The Lhasa Apso is a small, sturdy breed known for its long, flowing coat and independent nature. They are affectionate, intelligent, and make excellent companions for individuals and families.",
    "12-15"
  ],
  [
    "Lowchen",
    false,
    "The Lowchen is a small, cheerful breed known for its long, flowing coat and lion-like appearance. They are friendly, intelligent, and make great companions for active families.",
    "12-14"
  ],
  [
    "Maltese",
    false,
    "The Maltese is a small toy breed known for its silky white coat and affectionate personality. They are friendly, playful, and make great companions for families and individuals.",
    "12-15"
  ],
  [
    "Manchester Terrier",
    false,
    "The Manchester Terrier is a small breed known for its sleek coat and energetic, alert personality. They are intelligent, loyal, and make excellent companions for active owners.",
    "14-16"
  ],
  [
    "Maremma Sheepdog",
    false,
    "The Maremma Sheepdog is a large, protective breed known for its loyalty and excellent guarding abilities. They are intelligent, independent, and make great guardians for families and livestock.",
    "12-15"
  ],
  [
    "Mastiff",
    false,
    "The Mastiff is a giant breed known for its size and calm, gentle nature. They are loyal, protective, and make excellent family pets and guardians.",
    "6-12"
  ],
  [
    "Miniature American Shepherd",
    false,
    "The Miniature American Shepherd is a small-to-medium herding breed known for its intelligence and agility. They are energetic, loyal, and make great pets for active families.",
    "12-15"
  ],
  [
    "Miniature Bull Terrier",
    false,
    "The Miniature Bull Terrier is a small, muscular breed known for its egg-shaped head and playful nature. They are energetic, intelligent, and make great companions for active families.",
    "11-14"
  ],
  [
    "Miniature Pinscher",
    false,
    "The Miniature Pinscher is a small, energetic breed known for its bold personality and sleek coat. They are intelligent, independent, and make excellent companions for active owners.",
    "12-16"
  ],
  [
    "Miniature Schnauzer",
    false,
    "The Miniature Schnauzer is a small breed known for its distinctive beard and eyebrows. They are intelligent, playful, and make great family pets and companions.",
    "12-15"
  ],
  [
    "Neapolitan Mastiff",
    false,
    "The Neapolitan Mastiff is a giant breed known for its impressive size and wrinkled coat. They are calm, protective, and make excellent guardians for families and homes.",
    "7-9"
  ],
  [
    "Newfoundland",
    false,
    "The Newfoundland is a giant breed known for its calm demeanor and excellent swimming abilities. They are friendly, loyal, and make great family pets, particularly for active households.",
    "8-10"
  ],
  [
    "Norfolk Terrier",
    false,
    "The Norfolk Terrier is a small, energetic breed known for its lively and friendly personality. They are intelligent, playful, and make great companions for families and individuals.",
    "12-15"
  ],
  [
    "Norwegian Buhund",
    false,
    "The Norwegian Buhund is a small-to-medium herding breed known for its energetic and friendly nature. They are intelligent, loyal, and make great pets for active families.",
    "12-15"
  ],
  [
    "Norwegian Elkhound",
    false,
    "The Norwegian Elkhound is a medium-sized breed known for its hunting abilities and friendly demeanor. They are energetic, intelligent, and make excellent companions for active families.",
    "12-15"
  ],
  [
    "Norwegian Lundehund",
    false,
    "The Norwegian Lundehund is a small breed known for its unique traits, including six toes on each foot. They are energetic, friendly, and make great companions for active owners.",
    "12-14"
  ],
  [
    "Norwich Terrier",
    false,
    "The Norwich Terrier is a small, spirited breed known for its friendly, confident personality. They are energetic, intelligent, and make great pets for individuals and families.",
    "12-15"
  ],
  [
    "Nova Scotia Duck Tolling Retriever",
    false,
    "The Nova Scotia Duck Tolling Retriever is a medium-sized sporting breed known for its exceptional hunting skills. They are intelligent, energetic, and make great family pets.",
    "12-14"
  ],
  [
    "Old English Sheepdog",
    false,
    "The Old English Sheepdog is a large, fluffy breed known for its gentle, affectionate nature. They are intelligent, playful, and make excellent family pets and working dogs.",
    "10-12"
  ],
  [
    "Otterhound",
    false,
    "The Otterhound is a large breed known for its distinctive appearance and love of water. They are energetic, intelligent, and make great companions for active families and individuals.",
    "10-13"
  ],
  [
    "Papillon",
    false,
    "The Papillon is a small toy breed known for its distinctive butterfly-like ears. They are intelligent, energetic, and make great companions for families and individuals.",
    "12-16"
  ],
  [
    "Pekingese",
    false,
    "The Pekingese is a small, compact breed known for its distinctive flat face and luxurious coat. They are affectionate, independent, and make excellent companions for individuals and families.",
    "12-15"
  ],
  [
    "Pembroke Welsh Corgi",
    false,
    "The Pembroke Welsh Corgi is a small-to-medium herding breed known for its short legs and energetic personality. They are intelligent, friendly, and make excellent family pets.",
    "12-15"
  ],
  [
    "Petit Basset Griffon Vendeen",
    false,
    "The Petit Basset Griffon Vendeen is a small, energetic breed known for its long body and distinctive voice. They are playful, intelligent, and make great companions for active families.",
    "12-15"
  ],
  [
    "Pharaoh Hound",
    false,
    "The Pharaoh Hound is a medium-sized breed known for its sleek appearance and friendly, elegant nature. They are intelligent, energetic, and make great companions for active owners.",
    "12-14"
  ],
  [
    "Plott Hound",
    false,
    "The Plott Hound is a medium-to-large breed known for its hunting abilities and strong, independent nature. They are loyal, energetic, and make great companions for active families.",
    "12-14"
  ],
  [
    "Pointer",
    false,
    "The Pointer is a medium-to-large sporting breed known for its exceptional hunting and pointing skills. They are energetic, intelligent, and make great companions for active families.",
    "12-14"
  ],
  [
    "Polish Lowland Sheepdog",
    false,
    "The Polish Lowland Sheepdog is a medium-sized herding breed known for its thick coat and lively personality. They are intelligent, energetic, and make great companions for active families.",
    "12-14"
  ],
  [
    "Pomeranian",
    false,
    "The Pomeranian is a small, fluffy breed known for its energetic and confident personality. They are intelligent, affectionate, and make great companions for families and individuals.",
    "12-16"
  ],
  [
    "Poodle",
    false,
    "The Poodle is a medium-to-large breed known for its intelligence, agility, and hypoallergenic coat. They are energetic, playful, and make great companions for families and individuals.",
    "12-15"
  ],
  [
    "Portuguese Podengo",
    false,
    "The Portuguese Podengo is a small-to-medium breed known for its versatility as a hunting dog. They are energetic, intelligent, and make excellent companions for active families and individuals.",
    "12-15"
  ],
  [
    "Portuguese Water Dog",
    false,
    "The Portuguese Water Dog is a medium-sized breed known for its love of water and excellent swimming abilities. They are intelligent, energetic, and make great companions for active families.",
    "10-14"
  ],
  [
    "Pug",
    false,
    "The Pug is a small breed known for its distinctive wrinkled face and affectionate nature. They are playful, loving, and make excellent companions for individuals and families alike.",
    "12-15"
  ],
  [
    "Puli",
    false,
    "The Puli is a medium-sized breed known for its unique corded coat. They are energetic, intelligent, and make great working dogs as well as loyal companions.",
    "10-15"
  ],
  [
    "Pumi",
    false,
    "The Pumi is a small-to-medium herding breed known for its curly coat and energetic personality. They are intelligent, lively, and make great companions for active families.",
    "12-14"
  ],
  [
    "Pyrenean Shepherd",
    false,
    "The Pyrenean Shepherd is a small, agile herding breed known for its intelligence and energetic nature. They are friendly, loyal, and make excellent companions for active families.",
    "12-15"
  ],
  [
    "Rat Terrier",
    false,
    "The Rat Terrier is a small, energetic breed known for its hunting instincts and playful nature. They are intelligent, friendly, and make great pets for active owners.",
    "12-18"
  ],
  [
    "Redbone Coonhound",
    false,
    "The Redbone Coonhound is a medium-to-large breed known for its exceptional scenting and hunting abilities. They are friendly, energetic, and make great companions for active families.",
    "10-12"
  ],
  [
    "Rhodesian Ridgeback",
    false,
    "The Rhodesian Ridgeback is a large breed known for its distinctive ridge of fur along its back. They are loyal, intelligent, and make excellent family pets and guardians.",
    "10-12"
  ],
  [
    "Rottweiler",
    false,
    "The Rottweiler is a large, powerful breed known for its loyalty and protective instincts. They are intelligent, confident, and make excellent guardians and family pets.",
    "8-10"
  ],
  [
    "Russell Terrier",
    false,
    "The Russell Terrier is a small, energetic breed known for its keen hunting instincts and playful nature. They are intelligent, friendly, and make excellent companions for active families.",
    "12-15"
  ],
  [
    "Saluki",
    false,
    "The Saluki is a slender, graceful breed known for its speed and hunting skills. They are independent, gentle, and make great companions for active individuals and families.",
    "12-14"
  ],
  [
    "Samoyed",
    false,
    "The Samoyed is a medium-to-large breed known for its fluffy white coat and friendly 'Sammy smile.' They are affectionate, energetic, and make great family pets.",
    "12-14"
  ],
  [
    "Schipperke",
    false,
    "The Schipperke is a small breed known for its fox-like appearance and energetic personality. They are intelligent, independent, and make excellent companions for active families.",
    "13-15"
  ],
  [
    "Scottish Deerhound",
    false,
    "The Scottish Deerhound is a large breed known for its noble appearance and hunting abilities. They are gentle, affectionate, and make great companions for active families.",
    "8-11"
  ],
  [
    "Scottish Terrier",
    false,
    "The Scottish Terrier is a small, sturdy breed known for its confident, independent personality. They are intelligent, playful, and make great companions for individuals and families.",
    "12-15"
  ],
  [
    "Sealyham Terrier",
    false,
    "The Sealyham Terrier is a small breed known for its distinctive appearance and friendly personality. They are intelligent, lively, and make great companions for families and individuals.",
    "12-14"
  ],
  [
    "Shetland Sheepdog",
    false,
    "The Shetland Sheepdog, or Sheltie, is a small-to-medium herding breed known for its intelligence and agility. They are loyal, energetic, and make great family pets.",
    "12-14"
  ],
  [
    "Shiba Inu",
    false,
    "The Shiba Inu is a small, agile breed known for its fox-like appearance and independent nature. They are intelligent, alert, and make great companions for active families.",
    "12-16"
  ],
  [
    "Shih Tzu",
    false,
    "The Shih Tzu is a small, affectionate breed known for its luxurious coat and friendly nature. They are playful, intelligent, and make excellent companions for families and individuals.",
    "10-16"
  ],
  [
    "Siberian Husky",
    false,
    "The Siberian Husky is a medium-to-large breed known for its endurance and striking appearance. They are energetic, independent, and make great companions for active families.",
    "12-15"
  ],
  [
    "Silky Terrier",
    false,
    "The Silky Terrier is a small breed known for its silky coat and energetic, confident personality. They are intelligent, lively, and make great companions for active individuals.",
    "12-15"
  ],
  [
    "Skye Terrier",
    false,
    "The Skye Terrier is a small breed known for its long coat and gentle, affectionate nature. They are intelligent, loyal, and make great companions for families and individuals.",
    "12-15"
  ],
  [
    "Sloughi",
    false,
    "The Sloughi is a medium-to-large breed known for its speed and graceful appearance. They are intelligent, independent, and make great companions for active individuals.",
    "12-14"
  ],
  [
    "Smooth Fox Terrier",
    false,
    "The Smooth Fox Terrier is a small breed known for its energetic personality and excellent hunting skills. They are intelligent, friendly, and make great companions for active families.",
    "12-14"
  ],
  [
    "Soft Coated Wheaten Terrier",
    false,
    "The Soft Coated Wheaten Terrier is a medium-sized breed known for its distinctive soft coat and friendly nature. They are energetic, intelligent, and make great family pets.",
    "12-14"
  ],
  [
    "Spanish Water Dog",
    false,
    "The Spanish Water Dog is a medium-sized breed known for its curly coat and excellent working abilities, especially in herding and water-related tasks. They are energetic, intelligent, and make great companions for active families.",
    "12-14"
  ],
  [
    "Spinone Italiano",
    false,
    "The Spinone Italiano is a medium-to-large breed known for its gentle nature and excellent hunting and pointing skills. They are friendly, intelligent, and make great companions for families who enjoy outdoor activities.",
    "10-12"
  ],
  [
    "Staffordshire Bull Terrier",
    false,
    "The Staffordshire Bull Terrier is a medium-sized breed known for its strength and affectionate nature. They are loyal, energetic, and make excellent family pets, especially with children.",
    "12-14"
  ],
  [
    "Standard Schnauzer",
    false,
    "The Standard Schnauzer is a medium-sized breed known for its distinctive beard and eyebrows. They are intelligent, alert, and make great companions for families and individuals seeking an active, loyal dog.",
    "12-14"
  ],
  [
    "Sussex Spaniel",
    false,
    "The Sussex Spaniel is a small-to-medium breed known for its distinctive long ears and affectionate, laid-back personality. They are friendly, intelligent, and make great companions for families.",
    "10-12"
  ],
  [
    "Swedish Vallhund",
    false,
    "The Swedish Vallhund is a small-to-medium herding breed known for its wolf-like appearance and energetic, friendly personality. They are intelligent, loyal, and make great family pets.",
    "12-15"
  ],
  [
    "Tibetan Mastiff",
    false,
    "The Tibetan Mastiff is a large, powerful breed known for its protective nature and thick coat. They are independent, intelligent, and make excellent guardians for families and homes.",
    "10-12"
  ],
  [
    "Tibetan Spaniel",
    false,
    "The Tibetan Spaniel is a small breed known for its affectionate personality and distinctive, lion-like mane. They are friendly, intelligent, and make excellent companions for individuals and families.",
    "12-16"
  ],
  [
    "Tibetan Terrier",
    false,
    "The Tibetan Terrier is a small-to-medium breed known for its long, thick coat and friendly, playful personality. They are intelligent, loyal, and make great companions for families.",
    "12-15"
  ],
  [
    "Toy Fox Terrier",
    false,
    "The Toy Fox Terrier is a small breed known for its energetic personality and intelligence. They are lively, affectionate, and make great companions for active individuals and families.",
    "12-15"
  ],
  [
    "Treeing Walker Coonhound",
    false,
    "The Treeing Walker Coonhound is a medium-to-large breed known for its excellent tracking and hunting abilities. They are energetic, friendly, and make great companions for active families.",
    "12-14"
  ],
  [
    "Vizsla",
    false,
    "The Vizsla is a medium-to-large breed known for its affectionate nature and excellent hunting skills. They are energetic, intelligent, and make great companions for active families and outdoor enthusiasts.",
    "10-14"
  ],
  [
    "Weimaraner",
    false,
    "The Weimaraner is a medium-to-large breed known for its sleek coat and exceptional hunting and tracking abilities. They are energetic, intelligent, and make great companions for active families.",
    "10-13"
  ],
  [
    "Welsh Springer Spaniel",
    false,
    "The Welsh Springer Spaniel is a medium-sized breed known for its affectionate nature and excellent hunting abilities. They are intelligent, friendly, and make great companions for families and active individuals.",
    "12-15"
  ],
  [
    "Welsh Terrier",
    false,
    "The Welsh Terrier is a small breed known for its energetic, playful nature and distinctive wiry coat. They are intelligent, loyal, and make great companions for active families.",
    "12-15"
  ],
  [
    "West Highland White Terrier",
    false,
    "The West Highland White Terrier, or Westie, is a small breed known for its distinctive white coat and spirited personality. They are intelligent, independent, and make great companions for families.",
    "12-16"
  ],
  [
    "Whippet",
    false,
    "The Whippet is a medium-sized breed known for its speed and graceful appearance. They are affectionate, gentle, and make excellent companions for active individuals and families.",
    "12-15"
  ],
  [
    "Wire Fox Terrier",
    false,
    "The Wire Fox Terrier is a small breed known for its energetic, playful personality and distinctive wiry coat. They are intelligent, lively, and make great companions for active families.",
    "12-14"
  ],
  [
    "Wirehaired Pointing Griffon",
    false,
    "The Wirehaired Pointing Griffon is a medium-to-large breed known for its excellent hunting and pointing skills. They are energetic, intelligent, and make great companions for families who enjoy outdoor activities.",
    "12-14"
  ],
  [
    "Wirehaired Vizsla",
    false,
    "The Wirehaired Vizsla is a medium-to-large breed known for its distinctive wiry coat and excellent hunting abilities. They are energetic, intelligent, and make great companions for active families.",
    "10-14"
  ],
  [
    "Xoloitzcuintli",
    false,
    "The Xoloitzcuintli, or Mexican Hairless Dog, is a small-to-medium breed known for its unique appearance and affectionate, loyal nature. They are intelligent, alert, and make great companions for individuals and families.",
    "12-14"
  ],
  [
    "Yorkshire Terrier",
    false,
    "The Yorkshire Terrier, or Yorkie, is a small breed known for its silky coat and energetic personality. They are intelligent, affectionate, and make great companions for families and individuals.",
    "12-15"
  ]
]
